Documents/ЗаявкаНаПроведениеРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЗаявкаНаПроведениеРемонта</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗапасыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗаявокНаПроведенияРемонта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЗаявокНаПроведениеРемонта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяУдобноеДляЗаказчика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяФактическогоВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийПоВыполнениюЗаявки</Name>
					<Comment>Комментарий по выполнению заявки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаПроведениеРемонта</Name>
					<Comment>Ответственный за проведение ремонта (мастер)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценкаПроведенияРемонта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОценокПроведенияРемонта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтатусовЗаявкиНаПроведениеРемонта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаявкаНаПроведениеРемонта/Forms/ФормаСписка/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ДЛЯ СОЗДАНИЯ ОТБОРОВ

// Процедура создает отбор по виду операции.
//
&НаКлиенте
Процедура ОтборВидОперацииПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ВидОперации", ОтборВидОперации, ЗначениеЗаполнено(ОтборВидОперации));
	
КонецПроцедуры

// Процедура создает отбор по статусу заявки.
//
&НаКлиенте
Процедура ОтборСтатусЗаявкиПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "СтатусЗаявки", ОтборСтатусЗаявки, ЗначениеЗаполнено(ОтборСтатусЗаявки));
	
КонецПроцедуры

// Процедура создает отбор по ответственному.
//
&НаКлиенте
Процедура ОтборМастерПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ОтветственныйЗаПроведениеРемонта", ОтборМастер, ЗначениеЗаполнено(ОтборМастер));
	
КонецПроцедуры

// Процедура создает отбор по зданию.
//
&НаКлиенте
Процедура ОтборЗданиеПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Здание", ОтборЗдание, ЗначениеЗаполнено(ОтборЗдание));
	
КонецПроцедуры

// Процедура создает отбор по виду заявки.
//
&НаКлиенте
Процедура ОтборВидЗаявкиПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ВидЗаявки", ОтборВидЗаявки, ЗначениеЗаполнено(ОтборВидЗаявки));

КонецПроцедуры

// Процедура создает отбор по организации.
//
&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Организация", ОтборОрганизация, ЗначениеЗаполнено(ОтборОрганизация));

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	#Если ВебКлиент Тогда
		ТекстСкрипта = РаботаСКартамиСервер.ПолучитьТекстМакета();
	#КонецЕсли

	
	Список.Параметры.УстановитьЗначениеПараметра("ТекВремя", ТекущаяДата());

	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура - обработчик события ПередНачаломДобавления списка.
//
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
		
		Отказ = Истина;
		
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("ВидЗаявки", ОтборВидЗаявки);
		СтруктураПараметров.Вставить("Организация", ОтборОрганизация);
		СтруктураПараметров.Вставить("ВидОперации", ОтборВидОперации);
		СтруктураПараметров.Вставить("Здание", ОтборЗдание);
		
		ОткрытьФорму("Документ.ЗаявкаНаПроведениеРемонта" + ".ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", СтруктураПараметров));
		
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	//Временно отключено
	//Строка = Элементы.Список.ТекущиеДанные;
	//Здание = Строка.Здание;
	//
	//Попытка
	//
	//	ДобавитьЭлементМаркера();
	//
	//Исключение
	//
	//КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭлементМаркера(АдресЗдания = Неопределено)
	
	Если АдресЗдания = Неопределено Тогда
		Строка = Элементы.Список.ТекущиеДанные;
		Здание = Строка.Здание;
	Иначе
		Здание = Строка.Организация;
	КонецЕсли;	
	
	Стр = ПолучитьРеквизитыЗданияНаСервере(Здание);

	Документ = Элементы.ПолеСкрипта.Document;
	
	Документ.parentWindow.ClearCollection();
	
	Если НЕ ЗначениеЗаполнено(Здание) Тогда
		Документ.parentWindow.ClearCollection();
		Возврат;
	КонецЕсли;
	
	лЗаголовок = "";
	Описание = "";
	Подвал = "";
	
	Если Стр.Свойство("Заголовок") Тогда
		лЗаголовок = Стр.Заголовок;
	КонецЕсли;
	
	Если Стр.Свойство("Описание") Тогда
		Описание = Стр.Описание;
	КонецЕсли;
	
	Если Стр.Свойство("Подвал") Тогда
		Подвал = Стр.Подвал;
	КонецЕсли;
	
	Если Стр.Свойство("Подсказка") Тогда
		Подсказка = Стр.Подсказка;
	КонецЕсли;
	
	ОтображаемаяИконка = "";
	
	//#Если Не ВебКлиент Тогда
	//	ОтображаемаяИконка = КаталогИконок + Стр.Иконка + ".png";	
	//#Иначе	
	//	КаталогИконокНаСайте = "http://www.agentplus.ru/download/1CModules/8/8.2/11/icons/";	
	//	ОтображаемаяИконка = КаталогИконокНаСайте + апСервер.Транслит(Стр.Иконка) + ".png";
	//	
	//	Если Найти(Стр.Иконка, "партнер")>0 Тогда //индивидуальная иконка партнера
	//		ОтображаемаяИконка = КаталогИконокНаСайте + апСервер.Транслит("ИконкаКонтрагент") + ".png";	
	//	КонецЕсли;
	//#КонецЕсли
	
	Документ.parentWindow.setMarker(Стр.Широта, Стр.Долгота, ОтображаемаяИконка, лЗаголовок, Описание, Подвал, Подсказка);
		
КонецПроцедуры //ДобавитьЭлементМаркера 

 &НаСервере
Функция ПолучитьЗдание(ВхПараметр = Неопределено)
	
	Если ВхПараметр <> Неопределено Тогда
		ДокументСсылка = Документы.ЗаявкаНаПроведениеРемонта.НайтиПоНомеру(ВхПараметр);
		Возврат ДокументСсылка.Здание;
	Иначе
		//ЗданиеСсылка = Справочники.ЗданияИСооружения.НайтиПоНаименованию(Элементы.ДекорацияАдресДома.Заголовок);
		//Возврат ЗданиеСсылка;
	КонецЕсли;
	
КонецФункции


 &НаСервере
Функция ПолучитьРеквизитыЗданияНаСервере(Здание)
	
	Стр = Новый Структура("Иконка, Заголовок, Описание, Подвал, Широта, Долгота, Подсказка",
	"1", "2", "", "3", Здание.Широта, Здание.Долгота, "4");

	Возврат Стр;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьМакет();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМакет()
	ТекстМакета	= РаботаСКартамиКлиент.ПолучитьТекстМакета();
	//ТекстМакета = СтрЗаменить(ТекстМакета, "uk-UA", "ru-RU");
#Если Не ВебКлиент Тогда
	Документ = Элементы.ПолеСкрипта.Document;	
	
	Если Документ<>Неопределено Тогда 
		Документ.designMode = "On";
		Документ.write(ТекстМакета);	
		Документ.designMode = "Off";  		
	КонецЕсли;
	//передаем параметр, показывающий, что файл скрипта используется для отчета		
	//Документ.parentWindow.name = РаботаСКартамиСервер.СформироватьПараметрРежимРедактора("Report", Объект.ИсточникКарты);

#Иначе
	ТекстСкрипта = ТекстМакета;
#КонецЕсли
КонецПроцедуры
